<?php

return [
    'arrPref' => [
        '北海道' => '北海道',
        '青森県' => '青森県',
        '岩手県' => '岩手県',
        '宮城県' => '宮城県',
        '秋田県' => '秋田県',
        '山形県' => '山形県',
        '福島県' => '福島県',
        '茨城県' => '茨城県',
        '栃木県' => '栃木県',
        '群馬県' => '群馬県',
        '埼玉県' => '埼玉県',
        '千葉県' => '千葉県',
        '東京都' => '東京都',
        '神奈川県' => '神奈川県',
        '新潟県' => '新潟県',
        '富山県' => '富山県',
        '石川県' => '石川県',
        '福井県' => '福井県',
        '山梨県' => '山梨県',
        '長野県' => '長野県',
        '岐阜県' => '岐阜県',
        '静岡県' => '静岡県',
        '愛知県' => '愛知県',
        '三重県' => '三重県',
        '滋賀県' => '滋賀県',
        '京都府' => '京都府',
        '大阪府' => '大阪府',
        '兵庫県' => '兵庫県',
        '奈良県' => '奈良県',
        '和歌山県' => '和歌山県',
        '鳥取県' => '鳥取県',
        '島根県' => '島根県',
        '岡山県' => '岡山県',
        '広島県' => '広島県',
        '山口県' => '山口県',
        '徳島県' => '徳島県',
        '香川県' => '香川県',
        '愛媛県' => '愛媛県',
        '高知県' => '高知県',
        '福岡県' => '福岡県',
        '佐賀県' => '佐賀県',
        '長崎県' => '長崎県',
        '熊本県' => '熊本県',
        '大分県' => '大分県',
        '宮崎県' => '宮崎県',
        '鹿児島県' => '鹿児島県',
        '沖縄県' => '沖縄県',
    ],
    'arrPrefCode' => [
        [[
            "prefCode" => 1,
            "prefName" => "北海道"
        ], [
            "prefCode" => 2,
            "prefName" => "青森県"
        ], [
            "prefCode" => 3,
            "prefName" => "岩手県"
        ], [
            "prefCode" => 4,
            "prefName" => "宮城県"
        ], [
            "prefCode" => 5,
            "prefName" => "秋田県"
        ], [
            "prefCode" => 6,
            "prefName" => "山形県"
        ], [
            "prefCode" => 7,
            "prefName" => "福島県"
        ], [
            "prefCode" => 8,
            "prefName" => "茨城県"
        ], [
            "prefCode" => 9,
            "prefName" => "栃木県"
        ], [
            "prefCode" => 10,
            "prefName" => "群馬県"
        ], [
            "prefCode" => 11,
            "prefName" => "埼玉県"
        ], [
            "prefCode" => 12,
            "prefName" => "千葉県"
        ], [
            "prefCode" => 13,
            "prefName" => "東京都"
        ], [
            "prefCode" => 14,
            "prefName" => "神奈川県"
        ], [
            "prefCode" => 15,
            "prefName" => "新潟県"
        ], [
            "prefCode" => 16,
            "prefName" => "富山県"
        ], [
            "prefCode" => 17,
            "prefName" => "石川県"
        ], [
            "prefCode" => 18,
            "prefName" => "福井県"
        ], [
            "prefCode" => 19,
            "prefName" => "山梨県"
        ], [
            "prefCode" => 20,
            "prefName" => "長野県"
        ], [
            "prefCode" => 21,
            "prefName" => "岐阜県"
        ], [
            "prefCode" => 22,
            "prefName" => "静岡県"
        ], [
            "prefCode" => 23,
            "prefName" => "愛知県"
        ], [
            "prefCode" => 24,
            "prefName" => "三重県"
        ], [
            "prefCode" => 25,
            "prefName" => "滋賀県"
        ], [
            "prefCode" => 26,
            "prefName" => "京都府"
        ], [
            "prefCode" => 27,
            "prefName" => "大阪府"
        ], [
            "prefCode" => 28,
            "prefName" => "兵庫県"
        ], [
            "prefCode" => 29,
            "prefName" => "奈良県"
        ], [
            "prefCode" => 30,
            "prefName" => "和歌山県"
        ], [
            "prefCode" => 31,
            "prefName" => "鳥取県"
        ], [
            "prefCode" => 32,
            "prefName" => "島根県"
        ], [
            "prefCode" => 33,
            "prefName" => "岡山県"
        ], [
            "prefCode" => 34,
            "prefName" => "広島県"
        ], [
            "prefCode" => 35,
            "prefName" => "山口県"
        ], [
            "prefCode" => 36,
            "prefName" => "徳島県"
        ], [
            "prefCode" => 37,
            "prefName" => "香川県"
        ], [
            "prefCode" => 38,
            "prefName" => "愛媛県"
        ], [
            "prefCode" => 39,
            "prefName" => "高知県"
        ], [
            "prefCode" => 40,
            "prefName" => "福岡県"
        ], [
            "prefCode" => 41,
            "prefName" => "佐賀県"
        ], [
            "prefCode" => 42,
            "prefName" => "長崎県"
        ], [
            "prefCode" => 43,
            "prefName" => "熊本県"
        ], [
            "prefCode" => 44,
            "prefName" => "大分県"
        ], [
            "prefCode" => 45,
            "prefName" => "宮崎県"
        ], [
            "prefCode" => 46,
            "prefName" => "鹿児島県"
        ], [
            "prefCode" => 47,
            "prefName" => "沖縄県"
        ]]
    ],
    'arrEmployments' => [
        'アルバイト・パート' => 'アルバイト・パート',
        '正社員' => '正社員',
        '契約社員' => '契約社員',
        'その他' => 'その他',
    ],
    'arrUserEmployments' => [
        'アルバイト・パート' => 'アルバイト・パート',
        '正社員' => '正社員',
        '契約社員' => '契約社員',
    ],
    'arrCareers' => [
        'ホールスタッフ(配膳)' => 'ホールスタッフ(配膳)',
        'キッチンスタッフ' => 'キッチンスタッフ',
        '皿洗い・洗い場' => '皿洗い・洗い場',
        '店長経験' => '店長経験',
        'マネージャー経験' => 'マネージャー経験',
        'フードデリバリー経験' => 'フードデリバリー経験',
        'その他' => 'その他',
    ],
    'arrGenders' => [
        1 => '男',
        2 => '女',
    ],
    'arrWorktimesPerDay' => [
        '3時間以下' => '3時間以下',
        '3時間以上' => '3時間以上',
        '5時間以上' => '5時間以上',
        '8時間以上' => '8時間以上',
    ],
    'arrWorkDurations' => [
        '1ヵ月以内' => '1ヵ月以内',
        '3ヵ月以内' => '3ヵ月以内',
        '半年以内' => '半年以内',
        '半年以上' => '半年以上',
    ],
    'arrRestaurantYears' => [
        '1年以内' => '1年以内',
        '1年以上' => '1年以上',
        '2年以上' => '2年以上',
        '3年以上' => '3年以上',
        '4年以上' => '4年以上',
        '5年以上' => '5年以上',
        '6年以上' => '6年以上',
        '7年以上' => '7年以上',
        '8年以上' => '8年以上',
        '9年以上' => '9年以上',
        '10年以上' => '10年以上',
        '15年以上' => '15年以上',
        '20年以上' => '20年以上',
    ],
    'arrGender' => [
        '1' => '男性',
        '2' => '女性',
    ],
    'arrItemGender' => [
        '1' => '男性',
        '2' => '女性',
        '0' => '男女問わず',
    ],
    'arrMailMagFlag' => [
        '1' => '希望する',
        '0' => '希望しない',
    ],
    'arrCustomerStatus' => [
        '0' => '仮登録・無効',
        '1' => '正会員・有効',
        '2' => '停止中',
    ],
    'arrSellerStatus' => [
        '0' => '仮登録・無効',
        '1' => '正会員・有効',
        '2' => 'ログイン制限',
        '3' => '強制退会',
    ],
    'arrUserRank' => [
        'general' => '一般会員',
        'official' => '公式会員',
    ],
    'arrDispNum' => [
        '20' => '20',
        '40' => '40',
        '60' => '60',
        '80' => '80',
        '100' => '100',
    ],
    'arrPointList' => [
        '1000' => '1000',
        '2000' => '2000',
        '3000' => '3000',
        '5750' => '5750',
        '12000' => '12000',
        '37500' => '37500',
    ],
    'arrPointRateList' => [
        1080 => ['point' => 1000, 'text' => '1000 PT'],
        2160 => ['point' => 2000, 'text' => '2000 PT'],
        3240 => ['point' => 3000, 'text' => '3000 PT'],
        5400 => ['point' => 5750, 'text' => '5750 PT （15％UP!!）'],
        10800 => ['point' => 12000, 'text' => '12000 PT（20％UP!!）'],
        32400 => [ 'point' => 37500, 'text' => '37500 PT（25％UP!!）'],
    ],
    'arrPaymentMethod' => [
        'credit_card' => 'クレジットカード',
        'bank_transfer' => '銀行振込',
    ],
    'arrPaymentStatus' => [
        '0' => '申請中',
        '1' => '決済完了',
        '2' => '決済不可',
        '99' => 'キャンセル',
    ],
    'univapay_application_token' => 'eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJhcHBfdG9rZW4iLCJpYXQiOjE3MjYyODA2NzUsIm1lcmNoYW50X2lkIjoiMTFlYjIyMzctMjVjMi1hZDdlLTg1YzgtMGY4MDEwYmNjNWJmIiwic3RvcmVfaWQiOiIxMWViMjIzNy1jY2MwLWFiZDAtYWQwMy1mYjE3MDA0NmIwNTAiLCJkb21haW5zIjpbImRlbW8xNi5lY2ZsaXguY29tIl0sIm1vZGUiOiJ0ZXN0IiwiY3JlYXRvcl9pZCI6IjExZWIyMjM3LTI1YzItYWQ3ZS04NWM4LTBmODAxMGJjYzViZiIsInZlcnNpb24iOjEsImp0aSI6IjExZWY3MjQwLTdjM2ItMjk4MS1iN2RhLThmYWFiMzU2Yzc0NiJ9.bRNSQuLCetIouI5j49Vgg2IpZjtUopLc9yiA5e5SEU8',
    'arrCategory' => array(
        '雇用形態' => array(
            '雇用形態-アルバイト・パート' => '　アルバイト・パート',
            '雇用形態-正社員' => '　正社員',
            '雇用形態-契約社員' => '　契約社員',
        )
    ),
    'arrAdminCategory' => array(
        '動画-動画1' => '　動画1',
        '動画-動画2' => '　動画2',
        '動画-その他' => '　その他',
        '電子書籍-雑誌' => '　雑誌',
        '電子書籍-漫画・同人誌' => '　漫画・同人誌',
        '電子書籍-小説' => '　小説',
        '電子書籍-写真集' => '　写真集',
        '電子書籍-その他' => '　その他',
        'スキル-制作' => '　制作',
        'スキル-相談' => '　相談',
        'スキル-アイデア' => '　アイデア',
        'スキル-その他' => '　その他',
        'ソフトウェア-ビジネスソフト' => '　ビジネスソフト',
        'ソフトウェア-動画' => '　動画',
        'ソフトウェア-画像' => '　画像',
        'ソフトウェア-音楽編集' => '　音楽編集',
        'ソフトウェア-ユーティリティー' => '　ユーティリティー',
        'ソフトウェア-ゲーム・エンタメ' => '　ゲーム・エンタメ',
        'ソフトウェア-Mac OSソフト' => '　Mac OSソフト',
        'ソフトウェア-その他' => '　その他',
        'WEB素材-WEBテンプレート' => '　WEBテンプレート',
        'WEB素材-フォント' => '　フォント',
        'WEB素材-イラスト' => '　イラスト',
        'WEB素材-写真素材' => '　写真素材',
        'WEB素材-効果音素材' => '　効果音素材',
        'WEB素材-動画素材' => '　動画素材',
        'WEB素材-その他' => '　その他',
        'チケット-コンサート' => '　コンサート',
        'チケット-興行' => '　興行',
        'チケット-レッスン' => '　レッスン',
        'チケット-その他' => '　その他',
        '学習・教育-語学' => '　語学',
        '学習・教育-教育' => '　教育',
        '学習・教育-学習' => '　学習',
        '学習・教育-受験' => '　受験',
        '学習・教育-資格' => '　資格',
        '学習・教育-検定' => '　検定',
        '学習・教育-その他' => '　その他',
        'ビジネス-株式' => '　株式',
        'ビジネス-FX' => '　FX',
        'ビジネス-投資' => '　投資',
        'ビジネス-テンプレート文書' => '　テンプレート文書',
        'ビジネス-その他' => '　その他',
        '趣味・実用-趣味' => '　趣味',
        '趣味・実用-実用' => '　実用',
        '趣味・実用-お稽古' => '　お稽古',
        '趣味・実用-医療' => '　医療',
        '趣味・実用-健康' => '　健康',
        '趣味・実用-美容' => '　美容',
        '趣味・実用-占い' => '　占い',
        '趣味・実用-スピリチュアル' => '　スピリチュアル',
        '趣味・実用-その他' => '　その他',
    ),
    'arrItemStatus' => [
        '0' => '申請中',
        '1' => '決済完了',
        '2' => '決済不可',
        '99' => 'キャンセル',
    ],
    'arrPublicStatus' => [
        '0' => '非公開',
        '1' => '公開済み',
    ],
    'arrIsOffering' => [
        '1' => '有り',
        '0' => '無し',
    ],
    // 販売ステータス
    'arrSelling' => [
        '1' => '掲載中',
        '0' => '一時停止',
        '2' => '掲載終了',
    ],

    'arrCashingStatus' => [
        '0' => '換金申請中',
        '1' => '換金済み',
        '2' => 'キャンセル',
        '3' => '換金不可',
    ],
    'arrMessageStatus' => [
        '0' => '下書き',
        '1' => '送信済み',
        '2' => 'ゴミ箱',
    ],
    'mail' => [
        'password' => array(
            'subject' => 'パスワードの再発行を行なってください',
            'template' => 'emails.auth.reset_password'
        ),
        'register' => array(
            'subject' => '仮登録のご案内【' . env('APP_NAME') . '】',
            'template' => 'emails.auth.register',
        ),
        'purchaseComplete' => array(
            'template' => 'emails.purchase_complete',
            'subject' => '求人の購入が完了しました',
        ),
        'purchasedToSeller' => array(
            'template' => 'emails.purchased_to_seller',
            'subject' => 'あなたの求人が購入されました。',
        ),
        'pointPurchaseComplete' => array(
            'template' => 'emails.point_purchase',
            'subject' => '決済が完了しました',
        ),
        'pointPurchaseBankComplete' => array(
            'template' => 'emails.point_purchase_bank',
            'subject' => '銀行振込をお願いします',
        ),
        'concern' => array(
            'template' => 'emails.concern',
            'subject' => '気になるを通知が届きました',
        ),
        'contactToAdmin' => array(
            'template' => 'emails.contact_to_admin',
            'subject' => 'お問い合わせがありました。',
        ),
        'contactToUser' => array(
            'template' => 'emails.contact_to_user',
            'subject' => 'お問い合わせありがとうございます。',
        ),
        'basicRegisterComplete' => array(
            'template' => 'emails.auth.register_complete',
            'subject' => '新規登録が完了しました。',
        ),
//        'messageToSaller' => array(
//            'templete' => 'message_to_saller',
//            'subject' => '販売者にメッセージを送りました',
//        ),
//        'notificationToSaller' => array(
//            'templete' => 'notification_to_saller',
//            'subject' => '出品者に気になるを通知しました',
//        ),

    ],
    'pageTitle' => [
        'privacy' => '個人情報保護について',
        'law' => '特定商法取引に基づく表記',
        'guide' => '購入者ガイド',
        'guide_sale' => '出品者ガイド',
        'contact' => 'お問い合わせ',
        'cart' => 'カート',
        'category' => 'カテゴリ一覧',
        'detail' => '求人詳細',
        'items' => '求人一覧',
        'mypage' => 'マイページ',
        'tag' => 'タグ一覧',
        'member' => '新規会員登録',
        'kinds' => 'ジャンル一覧',
        'register' => '登録情報管理',
        'itemRegister' => '求人登録ページ',
        'myPurchase' => 'マイページ購入者用管理',
        'login' => 'ログイン',
    ],
    'rating' => [
        '1' => '悪い',
        '2' => 'やや悪い',
        '3' => '普通',
        '4' => '良い',
        '5' => '大変良い',
    ],
    'notice' => [
        '1' => 'ON',
        '0' => 'OFF',
    ],
    'info' =>  [
       'adminMail' => env('MAIL_FROM_ADMIN_ADDRESS'),
       'sendDomain' => env('MAIL_FROM_ADDRESS')
    ],
    'arrArea' => [
        '北海道' => '北海道',
        '青森県' => '青森県',
        '岩手県' => '岩手県',
        '宮城県' => '宮城県',
        '秋田県' => '秋田県',
        '山形県' => '山形県',
        '福島県' => '福島県',
        '茨城県' => '茨城県',
        '栃木県' => '栃木県',
        '群馬県' => '群馬県',
        '埼玉県' => '埼玉県',
        '千葉県' => '千葉県',
        '東京都' => '東京都',
        '神奈川県' => '神奈川県',
        '新潟県' => '新潟県',
        '富山県' => '富山県',
        '石川県' => '石川県',
        '福井県' => '福井県',
        '山梨県' => '山梨県',
        '長野県' => '長野県',
        '岐阜県' => '岐阜県',
        '静岡県' => '静岡県',
        '愛知県' => '愛知県',
        '三重県' => '三重県',
        '滋賀県' => '滋賀県',
        '京都府' => '京都府',
        '大阪府' => '大阪府',
        '兵庫県' => '兵庫県',
        '奈良県' => '奈良県',
        '和歌山県' => '和歌山県',
        '鳥取県' => '鳥取県',
        '島根県' => '島根県',
        '岡山県' => '岡山県',
        '広島県' => '広島県',
        '山口県' => '山口県',
        '徳島県' => '徳島県',
        '香川県' => '香川県',
        '愛媛県' => '愛媛県',
        '高知県' => '高知県',
        '福岡県' => '福岡県',
        '佐賀県' => '佐賀県',
        '長崎県' => '長崎県',
        '熊本県' => '熊本県',
        '大分県' => '大分県',
        '宮崎県' => '宮崎県',
        '鹿児島県' => '鹿児島県',
        '沖縄県' => '沖縄県',
        '海外' => '海外',
    ],
    'arrLanguage' => [
        '日本語' => '日本語',
        'ポルトガル語' => 'ポルトガル語',
        '中国語' => '中国語',
        '英語' => '英語',
        'アラビア語' => 'アラビア語',
        'イタリア語' => 'イタリア語',
        'ウルドゥー語' => 'ウルドゥー語',
        'カンボジア語' => 'カンボジア語',
        'スウェーデン語' => 'スウェーデン語',
        'スペイン語' => 'スペイン語',
        'スワヒリ語' => 'スワヒリ語',
        'タイ語' => 'タイ語',
        'タガログ語' => 'タガログ語',
        'トルコ語' => 'トルコ語',
        'ドイツ語' => 'ドイツ語',
        'ハンガリー語' => 'ハンガリー語',
        'ヒンディー語' => 'ヒンディー語',
        'フランス語' => 'フランス語',
        'ベトナム詰' => 'ベトナム詰',
        'ベンガル語' => 'ベンガル語',
        'ペルシア語' => 'ペルシア語',
        'ペルシャ語' => 'ペルシャ語',
        'ロシア語' => 'ロシア語',
        '韓国語' => '韓国語',
        'その他' => 'その他',
    ],
    'arrEmployeeCount' => [
        '単一回答' => '単一回答',
        '0人ー5人' => '0人ー5人',
        '6人ー10人' => '6人ー10人',
        '11人ー20人' => '11人ー20人',
        '21人ー30人' => '21人ー30人',
        '31人以上' => '31人以上',
    ],
    'arrEarning' => [
        '単一回答' => '単一回答',
        '0万円ー1000万円' => '0万円ー1000万円',
        '1001万円ー3000万円' => '1001万円ー3000万円',
        '3001万円ー5000万円' => '3001万円ー5000万円',
        '5001万円ー8000万円' => '5001万円ー8000万円',
        '8001万円ー10000万円' => '8001万円ー10000万円',
        '1億ー3億' => '1億－3億',
        'それ以上' => 'それ以上',
    ],
    'arrPostSNS' => [
        'Instagram' => 'Instagram',
        'TikTok' => 'TikTok',
        'X' => 'X',
        'YouTube' => 'YouTube',
        'Facebook' => 'Facebook',
        'そのほか' => 'そのほか',
    ],
    'arrIsEmergency' => [
        '1' => '急募',
    ],
    'arrIsRecommended' => [
        '1' => 'おすすめ案件',
    ],
    'arrInfluencerLevel' => [
        'シルバー' => 'シルバー',
        'ゴールド' => 'ゴールド',
        'プラチナ' => 'プラチナ',
        'ダイアモンド' => 'ダイアモンド',
    ],
    'arrMessageTemplate' => [
        '1' => '応募返信定型文',
        '2' => '依頼定型文',
        '3' => 'お見送りの文章',
        '4' => '採用お礼定型文',
        '5' => '来店お礼定型文',
        '6' => '投稿完了定型文',
    ],
    'arrRatingScore' => [
        '1' => '★（悪い）',
        '2' => '★★（やや悪い）',
        '3' => '★★★（普通）',
        '4' => '★★★★（良い）',
        '5' => '★★★★★（大変良い）',
    ],
    'arrOrderType' => [
        '1' => '案件起票',
        '2' => 'メッセージ起票',
    ],
    'arrOrderStatus' => [
        '-3' => '相談',
        '-2' => '案件起票',
        '-1' => '案受ける',
        '0' => '応募',
        '1' => '案件依頼',
        '2' => '来店確認',
        '3' => '評価',
        '4' => '完了',
        '5' => 'キャンセル',
    ],
    'arrItemCategory' => [
        'ホテル' => 'ホテル',
        '旅館' => '旅館',
        'グランピング' => 'グランピング',
        '貸別荘' => '貸別荘',
        '飲食店' => '飲食店',
        'レジャー・アクティビティ' => 'レジャー・アクティビティ',
        '交通機関' => '交通機関',
        'その他' => 'その他',
    ],
];
